work capital
interest rate
stock   
equity
superannuation
revenue 
roi
return on investment
net asset 
net profit
net income
net worth
margin
liquidity
liquidate 
loan
credit
debit
investment 
income
facility 
finance
debt
cash flow
cash book
capital
budget
bankrupt
bank
benchmark
bill
tax
asset
audit
account payable
balance 
balance sheet
bootstrapp
bottom line
accept 
add 
admit
advertise 
advise 
afford
approve 
authorize 
avoid
borrow 
break 
build
buy 
calculate 
call
cancel 
change 
charge for
check 
choose 
complain
complete 
confirm 
consider
convince 
count 
decide
decrease 
deliver 
develop
dismiss 
dispatch 
distribute
divide 
drop 
employ
encourage 
establish 
estimate
exchange 
extend 
fall
fix 
fund 
get worse
improve 
increase 
inform
install 
invest 
invoice
join 
lend 
lengthen
lower 
maintain 
manage
measure 
mention 
obtain
order 
organise 
owe
own 
pack 
participate
pay 
plan 
present
prevent 
process 
produce
promise 
promote 
provide
purchase 
raise 
reach
receive 
recruit 
reduce
refuse 
reject 
remind
remove 
reply 
resign
respond 
return 
rise
sell 
send 
separate
shorten 
split 
structure
succeed 
suggest 
write
vary 
advantage 
advice
agenda
apology 
authorization
bill 
brand 
commission 
comparison
competition 
competitor 
confirmation
cost 
creditor 
customer
deadline 
debt 
debtor
decision 
deficit
delivery 
department 
description
difference 
disadvantage 
distribution
employee 
employer 
enquiry
environment 
equipment 
experience 
explanation 
facility
factory 
fall 
feedback
goal 
goods 
growth
guarantee 
improvement 
increase
industry 
instruction 
interest
inventory 
invoice 
knowledge
limit 
loss 
market 
message 
mistake
objective 
offer 
opinion
option 
output
payment 
penalty 
permission
possibility 
preparation 
price
product 
production 
profit
promotion 
reduction
refund 
reminder 
repair
report 
responsibility 
result
retailer 
rise 
risk
salary 
sale 
schedule
share 
signature 
stock
success 
suggestion 
supply
support 
target 
transport
turnover
